---
type: VertexPositionNormal
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 4
tags: [revit-api, class]
---

# VertexPositionNormal

`Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexPositionNormal | 2017 | `public VertexPositionNormal ( XYZ position , XYZ normal )` |
| Method | GetSizeInFloats | 2017 | `public static int GetSizeInFloats ()` |
| Property | Normal | 2017 | `public XYZ Normal { get ; set ; }` |
| Property | Position | 2017 | `public XYZ Position { get ; set ; }` |